
package oop;

public class Ex01 {
	/*
	 * OOP (Object Oriented Programming)
	 * - 객체 지향 프로그래밍
	 * - 객체를 정의하고 객체 간에 상호작용을 구성해서 코드를 작성하는 방식
	 * 
	 * 
	 * 객체(Object)		: 현실에서 표현한 가능한 모든 데이터
	 * 클래스(Class)		: 객체를 프로그램 언어로 작성한 상태 (= 도면)
	 * 인스턴스(Instance)	: 클래스의 내용을 컴퓨터 메모리에 생성한 상태 (= 실체)
	 * 
	 * 
	 * 디자인 순서)
	 * 객체 선정 -> 클래스로 작성 -> 인스턴스로 컴퓨터에 생성
	 * 
	 * 
	 * 구문)
	 * 
	 * class [클래스명] {
	 * 		1. 필드		: 객체의 속성. 멤버 변수라고도 한다
	 * 		2. 메서드 		: 객체의 기능. 멤버 함수라고도 한다
	 * 		3. 정보은닉	: 외부로부터 보이면 안되는 데이터를 감춘다
	 * }
	 * 
	 * 
	 * - 클래스는 객체를 표현한 명세서. 즉, 도면 같은 존재
	 * - 이를, 실체로 만드는 구문을 new라고 한다
	 * 
	 * 
	 * new [클래스명] : 인스턴스를 생성하는 키워드
	 * - 생성된 인스턴스 '참조 변수'에 저장하지 않으면 일회용이 된다
	 * - 따라서 여러번 재사용하려면 '참조 변수'에 저장해서 사용한다
	 * 
	 */
}
